redshift.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-06-12 Mon 16:12 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>redshift oneshot calls</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:title" content="redshift oneshot calls">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/warm.png">
<meta property="og:url" content="https://notes.neeasade.net/redshift.html">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=abd38449620b2223dffce2c948aae610'>
<link rel='stylesheet' href='/assets/css/new.css?sum=716dbb6fbb74dcea14c1ee0dc8098072'>
<link rel='stylesheet' href='./assets/css/new.css?sum=716dbb6fbb74dcea14c1ee0dc8098072'>
<link rel='stylesheet' href='/assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='./assets/css/org.css?sum=19824060f71383b34e196f76ea8c38f1'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=6ef94b2648dc58ea39219e79af4ef6e9'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=6ef94b2648dc58ea39219e79af4ef6e9'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>../ğš‚ğšƒğš‡</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/notes/redshift.org">source</a>
</div>
<h1 class=title>redshift oneshot calls</h1>
<div class="org-center">
<p>

</p>
</div>

<hr>

<p>
cf <a href="https://github.com/jonls/redshift">https://github.com/jonls/redshift</a>
</p>

<p>
The value is always relative to the current tempurature, with &ldquo;current&rdquo; = 6500K. Repeating calls like <code>redshift -O 5000</code> will continue to darken the screen.
</p>

<p>
at night:
</p>
<div class="org-src-container">
<pre class="src src-sh">redshift -x
<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">redshift -O 1900K</span>
<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">redshift -O 3700K</span>
<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">redshift -O 5000K</span>
redshift -O 6500K
<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">redshift -O 8500K</span>
</pre>
</div>

<p>
reset:
</p>
<div class="org-src-container">
<pre class="src src-sh">redshift -x
</pre>
</div>

<p>
Supposedly using warmer temperatures will prevent eye strain. When setting it really low, I&rsquo;ve found it only takes a  few minutes to get used to a new color tempurature.
</p>
<div class="footer-center">
    
</div>
</div>
</body>
</html>